course_name0 = "تحليل وتصميم قواعد البيانات"
course_level0 = "Beginner"
course_keywords0 = ["Entity Relationships ERD Diagram", "SQL", "SQL Server", "EERD", "ne2one one2many many many"]

sys_input0 = f"""

course = {course_name0}
level = {course_level0}
keywords = {course_keywords0}

"""

sys_output0 = """

العنوان: 
مشاريع قاعدة البيانات تحليل وتصميم وتنفيذ مشروعات قواعد البياناتك

العنوان الفرعي: 
تحليل وتصميم وتنفيذ مشروعات لقواعد البيانات العلائقية

الأهداف: 

- مفاهيم قاعدة البيانات مفاهيم قواعد البيانات
- تحليل قاعدة البيانات كيفية تحليل قواعد البيانات
- تصميم قاعدة بيانات تصميم قواعد البيانات
- Entity Relationships ERD Diagram نموذج تمثيل البيانات الكيان والعلاقة
- مخطط EERD لعلاقات الكيانات المحسنة نموذج تمثيل الكيان والعلاقة الموسع
- لغة الاستعلام المهيكلة (SQL) اللغة القياسية للإستعلام عن البيانات
- MySQL تطبيقات على
- SQL Server تطبيقات على
- سكليتي تطبيقات على
- المشاريع مشروعات متعددة المستوى على قواعد البيانات

المتطلبات:
- لا توجد متطلبات مسبقة للدورات التدريبية لا توجد دورات آخرى لابد أن تكون متعلمها قبل هذه الدورة

الوصف:
تحتوى هذا الدورة على مقدمة عن قواعد البيانات عموما ثم تهتم بقواعد البيانات العلائقية قواعد البيانات العلائقية بداية من كتابة احتياجات البرامج متطلبات البيانات ثم تحليلها التحليل وتصميمها على النماذج الشهيرة لتمثيل البيانات إر, بيرة وتحويلها على المخطط العلائقي  وذلك من خلال استخدام أدوات رسم شهيرة مثل إردبلوس و نموذج مرئي وغيرها. وتطبق كل فكرة بشكل عملى على أشهر قواعد البيانات العلائقية MySQL و خادم SQL و سكليتي جزء بجزء وليس فى النهاية حتى لا يمل الطالب. وبعدها تتعرض الدورة لبرامج الشاشات الموحدة للتعامل مع قواعد البيانات المختلفة UUI مثل نافيكات ومن ثم التعامل مع لغة SQL كلغة موحدة فى التعامل مع قواعد البيانات العلائقية.


محتوى الدورة: 

* مقدمة
        - دورة مقدمة لمشاريع قواعد البيانات مقدمة عامة عن الدورة
        -قم بإعداد MySQL باستخدام PHPMyAdmin XAMPP
        - إعداد مشغل قاعدة بيانات خادم SQL
        - إعداد SQL Server Management Studio
        - إعداد استوديو سكليتي

* مقدمة إلى قاعدة البيانات:
        - منهجية تصميم قواعد البيانات, نماذج البيانات
       -مقدمة إلى قاعدة البيانات-معلومات البيانات - مكونات بيئة قاعدة البيانات
       - أعمار نظام قواعد البيانات
       - فئات تطبيق قواعد البيانات - قواعد بيانات الشركات الكبيرة, قواعد بيانات تطبيقات الجوال

* تحليل المتطلبات وتنفيذ علاقة الكيان:
       - سمة متعددة القيم وارسمها
       - تحليل المتطلبات لشركة الأثاث.
        - تصميم هيكل قاعدة البيانات. منهج نموذج العلاقة بين الكيانات ERD
        - نوع الكيان ومثيله
        - الدس و ارسمه في ERDPlus
           - تنفيذ Basic إر في SQL Server مع DataTypes
          - تنفيذ Basic إر في MySQL مع DataTypes
* السمة والرسم:
        -  تنفيذ إرث أساسي في سكليتي مع أنواع البيانات
        - سمة بسيطة، عادية، سمة مميزة، التنفيذ على
        - السمة والرسم. مراجعة اليكس الرموز
        - الكيانات الضعيفة والمنتظمة
        - الكيانات الضعيفة والمنتظمة


* نوع العلاقة ومثيل العلاقة:

        - أنواع العلاقات one2one one2many many many
        - قيود المشاركة في العلاقة مع دراسة الحالة
        - دراسة حالة
        - القيم من أنواع العلاقات
          - دراسة حالة 3 -
        - درجة نوع العلاقة (أوناري ، النظام الثنائي ، الثلاثي)
          - المنهجية -المخطط الارتباطي للكيان (نوع الكيان) مع أمثلة
          - المنهجية أنواع الكيانات - أنواع الكلمات مع الأمثلة
        - أنواع العلاقات مع أمثلة



الفئة المستهدفة:
- . يمكن للمتوسطين والمتقدمين أيضًا تعلم مهارات خاصة في هذه الدورة. للمبتدئين ومتوسطى المستوى وكذلك المتقدمين يمكن أن تضيف هذه الدورة لهم
- . دورة متخصصة فى من ليس على دراية بقواعد البيانات ولغة الإستعلامات ويريدوا دخول المجال بسرعة ودقة
- ربما تكون هذه الدورة مناسبة لك إذا كنت’نتطلع إلى معرفة المزيد من قواعد البيانات المتقدمة. هذه الدورة مميزة لمن يريد التعرف على قواعد البيانات العلائقية المختلفة وأوجه التشابه والإختلاف بينهم



"""

course_name1 = "How to prepare for  Scrum Master exam 2021"
course_level1 = "Beginner"
course_keywords1 = ["Scrum Artifacts", "Agile Mindset", "Agile Manifesto", "UI Developers", "Scrum  Roles "]

sys_input1 = f"""

course = {course_name1}
level = {course_level1}
keywords = {course_keywords1}

"""

sys_output1 = """



العنوان:
شهادة Scrum Master الاحترافية,2021 أسئلة الاختبار

العنوان الفرعي:
Agile كورس / Professional Scrum Master ، إعداد الامتحان وامتحان المحاكاة من Scrum Guide و Agile mind


الأهداف: 
- لضمان النجاح من اول مرة Professional Scrum Master  كيفية التحضير لامتحان
- و كيفية تطبيقها في العمل Agile Mindset فهم ال
- والنجاح بها Agile
- كيفية العمل في مشاريع تطبق ال
- و كيفية القيام به بشكل سليم، Scrum Master فهم دور
- تسليم مشاريع البرمجيات بشكل اسرع و بجودة اعلي
- العمل مع الفريق بشكل افضل
- و كيفية التعاون بينهم، Scrumفهم الادوارالمختلفة في
- واهميتها وكيفية إدارتها بشكل فعال،Scrum فهم الاجتماعات في
- بفاعلية Scrum Master التحضير للعب دور ال
- و كيفية القيام به بشكل سليم، مالك المنتج فهم دور
- بفاعلية مالك المنتج التحضير للعب دور ال
- Agile و Scrum الفرق بين ال
- Agile Manifesto تاريخ
- انواع الهدر - النفايات


المتطلبات:
- من البداية agile سوف يتم شرح كيفية تطبيق ال

الوصف:

- تم إعداد هذا البرنامج التدريبي المتكامل خصيصاً لإعداد متخصصين محترفين في إطار إدارة المشروعات باستخدام منهجية التحرك السريع ""Agile"".
- و ذلك عن طريق تدريس وتطبيق المبادئ والمفاهيم و شرح الممارسات والقيم الأساسية للAgile.
- مما يتيح لنا التأكد من قدرة المتدربين على:
- التعامل مع المواقف المختلفة والطارئة
- التعرف علي طرق التعامل مع تحديات ومعوقات المشاريع خاصة في مجال البرمجيات.
- التفكير الإبداعي وإيجاد البدائل الفعالة


لماذا يهمك كورس Scrum Master Professional؟
- يؤهلك البرنامج للعمل الاحترافي في المشروعات التي تطبق منهجية التحرك السريع ""Agile"".
- يؤهلك البرنامج للعمل كـ""Scrum Master"" بعد الحصول على الخبرات والمهارات اللازمة.
- يساعدك البرنامج على فهم واستيعاب الأدوار المختلفة ومهام كل منها في الـ""Scrum"".
- يساعدك البرنامج على تنمية وتطوير مهارات التواصل مع فريق العمل وإدارة الأفراد.
- يساعدك البرنامج على فهم آلية الاجتماعات وكيفية إدارتها في الـ""Scrum"".
- يساعدك البرنامج على ضمان إنهاء وتسليم مشاريع البرمجيات بشكل احترافي متميز.
- يؤهلك البرنامج لاجتياز الاختبارات اللازمة للحصول على شهادة Professional Scrum Master .




محتوى الدورة:

* مقدمة
        -   عقلية ال Agile
        -  Agile Manifesto
        - Scrum
        - Scrum: الصورة الكبيرة


* عقلية ال Agile وفلسفة الScrum

        - نظرية تجريبية
        - تدريجي ومتكرر
        - الشفافية , التفتيش والتكيف

* Scrum Artifacts

        - تراكم المنتجات
        - سبرينت باكولم
        - الزيادة
        - تعريف Done

* الفريق والأدوار
        -تنظيم الفرق
        - فريق متعدد الوظائف
        - مالك المنتج
        - فريق التطوير
        - Scrum  Roles 
        - اختبار الفرق والأدوار



الفئة المستهدفة:
- من يريد ان يتعلم كيف يطبق Agile بمشروعه
- من يريد ان يحصل علي شهادة Professional Scrum Master 1
- مالك المنتج من يطمح ان يعمل ك Scrum Master
- مديرو المشاريع
- Scrum Masters
- مطوّرو البرامج
- قادة الفريق
- مراقبة الجودة
- مصممي الجرافيك
- مديرو تقنية المعلومات
- مختبري البرامج
- UI Developers
- مالكو المنتجات




"""

course_name2 = "Artificial Intellignece using C# تعلم الذكاء الاصطناعي باستخدام C#"
course_level2 = "Beginner"
course_keywords2 = ["Artificial Intellignece", "C#", "الذكاء الاصطناعي", "VS", ".NET", "تصنيف الصور"]

sys_input2 = f"""

course = {course_name2}
level = {course_level2}
keywords = {course_keywords2}

"""

sys_output2 = """



العنوان:
(C#) الذكاء الاصطناعي

العنوان الفرعي:
ML.NET دورة تعليمية شاملة عن الذكاء الاصطناعي في بيئة عمل دوت نت باستخدام مكتبة


الأهداف: 
- تعلم اساسيات الذكاء الاصطناعي
- التعرف على الشبكات العصبية
- التعرف على اللغات البرمجية المستخدمة في الذكاء الاصطناعي
- ML.NET استخدام مكتبة
- تطوير نموذج تصنيف النصوص لتصنيف التعليقات السيئة من الجيدة
- تطوير نموذج التنبيء بالقيم
- تطوير نموذج تصنيف الصور
- تطوير نموذج اكتشاف الكائنات



المتطلبات:
- C# اللغة
- VS


الوصف:

ما هو الذكاء الاصطناعي؟
هو سلوك وخصائص معينة تتسم بها البرامج الحاسوبية، تجعلها تحاكي القدرات الذهنية البشرية وأنماط عملها. من أهم هذه الخصائص القدرة على التعلم والاستنتاج ورد الفعل على أوضاع لم تبرمج في الآلة.

ما هي مكتبة مل.NET
مل.NET هي مكتبة تعلم آلي برمجية مجانية للغات البرمجة C # و F #. كما أنه يدعم نماذج Python عند استخدامها مع ملفات

ماذا تقدم لك هذه الدورة؟
 تقدم لك هذه الدورة الاساسيات الخاصة في الذكاء الاصطناعي بطريقة مبسطة وملخصة وايضا بشكل تطبيقي على نماذج عمل

لمن هذه الدورة؟
لمطوري بيئة .NET وايضا لكل شخص يريد ان يتعلم الذكاء الاصطناعي بشكل عملي ومبسط

تتضمن الدورة التالي:
- تعريف عام بالذكاء الاصطناعي
- انواع الذكاء الاصطناعي
- اشهر اللغات المستخدمة
- التعرف على الشبكات العصبية وكيف تعمل
- التعرف على مكتبات الذكاء الاصطناعي
- التعرف على مكتبة مل.NET
- التعرف على نموذج تصنيف النصوص
- تطوير نموذج التعرف على التعليقات السيئة والجيدة
- التعرف على نموذج التنبئي
- تطوير نموذج التنبيء بالقيم
- التعرف على نموذج تصنيف الكائنات
- تطوير نموذج تصنيف الصور
- التعرف على نموذج التعرف على اجزاء الكائنات
- تطوير نموذج التعرف على الكائنات ضمن الصور
- التعرف على مواقع تجهيز قواعد البيانات
- التعرف على برامج تهيئة التعرف على الكائنات

يشكل الذكاء الاصطناعي تحديا والهاما لعلم الفلسفة ؛ لزعمه القدرة على إعادة خلق قدرات العقل البشري
هل هناك حدود لمدى ذكاء الآلات؟ هل هناك فرق جوهري بين الذكاء البشري والذكاء الاصطناعي؟ وهل يمكن أن يكون للآلة عقل ووعي؟ عدد قليل من أهم الإجابات 
آلات الحساب والذكاء "قانون تورنغ"


محتوى الدورة:

* مقدمة
* أساسيات
        -  ما هو الذكاء الاصطناعي
        - أنواع التعلم الآلي انواع تعلم الالة
        - ANNS الشبكات العصبية
        - أفضل لغات البرمجة في الذكاء الاصطناعي افضل لغات الذكاء الاصطناعي

* ML.NET التطبيق على

        - s ML.NET ما هي مكتبة
        - تنصيب ML.NET  و VS
        - ML.NET  خطوات العمل الرئيسة
        -  ML  اول مشروع
        - شرح الملفات شرح الملفات المتولدة
        - نموذج المستهلك استخدام الموديل
        - الحصول على دقة التصنيف
        - Explain Code of Build project


* سيناريو التنبؤ 
        - نموذج الانحدار تحليل الانحدار
        -  كاغل 

* سيناريو التوصية
* تصنيف الصور
* التعرف على الكائنات
        - Microsoft VoTT تهيئة بيانات التعلم الالي الخاص في اكتشاف الكائنات


الفئة المستهدفة:
- للمبتدئين - سنتعلم كل شيء من الصفر
- لمطوري .NET
- لمطوري C#


"""
